vp-services/src/test/resources/testfiles/Rivta20RequestNamespaceInHeader.xml

<?xml version='1.0' encoding='UTF-8'?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Header xmlns:ns5="http://www.w3.org/2005/08/addressing"
		xmlns:ns4="urn:riv:crm:scheduling:1.1" xmlns:ns3="urn:riv:crm:scheduling:1"
		xmlns:ns2="urn:riv:crm:scheduling:GetSubjectOfCareScheduleResponder:1"
		xmlns="urn:riv:interoperability:headers:1">
		<ns5:To>RIVTA20REQUEST</ns5:To>
	</soap:Header>
	<soap:Body>
		<ns2:GetSubjectOfCareSchedule xmlns="urn:riv:interoperability:headers:1"
			xmlns:ns2="urn:riv:crm:scheduling:GetSubjectOfCareScheduleResponder:1"
			xmlns:ns3="urn:riv:crm:scheduling:1" xmlns:ns4="urn:riv:crm:scheduling:1.1"
			xmlns:ns5="http://www.w3.org/2005/08/addressing">
			<ns2:healthcare_facility>SE2321000164-7381037590423
			</ns2:healthcare_facility>
			<ns2:subject_of_care>188803099368</ns2:subject_of_care>
		</ns2:GetSubjectOfCareSchedule>
	</soap:Body>
</soap:Envelope>